In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df = pd.read_csv(r"C:\Users\dell\Desktop\rupesh\Data Science Courses\Ashish Pandey Classes\datasets\Bank_churn_modelling.csv")

In [6]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [7]:
df.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [11]:
df = df.drop(['RowNumber', 'CustomerId','Surname'],axis=1)

In [12]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [13]:
x=df.drop("Exited", axis=1)
y=df["Exited"]

In [14]:
print(x.shape)
print(y.shape)

(10000, 10)
(10000,)

In [32]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, StandardScaler, MinMaxScaler
from sklearn.compose import ColumnTransformer

In [33]:
en=LabelEncoder()
df["Gender"] = en.fit_transform(df["Gender"])

In [18]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,0,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,0,41,1,83807.86,1,0,1,112542.58,0
2,502,France,0,42,8,159660.80,3,1,0,113931.57,1
3,699,France,0,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,0,43,2,125510.82,1,1,1,79084.10,0

In [24]:
sc = StandardScaler()

In [27]:
df["Age"]=sc.fit_transform(df[["Age"]])

In [28]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,0,0.293517,2,0.00,1,1,1,101348.88,1
1,608,Spain,0,0.198164,1,83807.86,1,0,1,112542.58,0
2,502,France,0,0.293517,8,159660.80,3,1,0,113931.57,1
3,699,France,0,0.007457,1,0.00,2,0,0,93826.63,0
4,850,Spain,0,0.388871,2,125510.82,1,1,1,79084.10,0

In [29]:
df["Age"].mean()

2.4846791291111003e-16

In [30]:
df["Age"].std()

1.000050003750302

In [34]:
sca =   MinMaxScaler()

In [35]:
df["Age"]=sca.fit_transform(df[["Age"]])

In [45]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,0,0.324324,2,0.00,1,1,1,101348.88,1
1,608,Spain,0,0.310811,1,83807.86,1,0,1,112542.58,0
2,502,France,0,0.324324,8,159660.80,3,1,0,113931.57,1
3,699,France,0,0.283784,1,0.00,2,0,0,93826.63,0
4,850,Spain,0,0.337838,2,125510.82,1,1,1,79084.10,0

In [51]:
df["Age"].describe()

count    10000.000000
mean         0.282727
std          0.141727
min          0.000000
25%          0.189189
50%          0.256757
75%          0.351351
max          1.000000
Name: Age, dtype: float64

In [52]:
transform=ColumnTransformer([("one",OneHotEncoder(),[1,2]),("sc", StandardScaler(),[0,3,4,5,6,9])])

In [53]:
data = transform.fit_transform(df)

In [54]:
data=pd.DataFrame(data)

In [55]:
data.head()

,0,1,2,3,4,5,6,7,8,9,10
0,1.0,0.0,0.0,1.0,0.0,-0.326221,0.293517,-1.041760,-1.225848,-0.911583,0.021886
1,0.0,0.0,1.0,1.0,0.0,-0.440036,0.198164,-1.387538,0.117350,-0.911583,0.216534
2,1.0,0.0,0.0,1.0,0.0,-1.536794,0.293517,1.032908,1.333053,2.527057,0.240687
3,1.0,0.0,0.0,1.0,0.0,0.501521,0.007457,-1.387538,-1.225848,0.807737,-0.108918
4,0.0,0.0,1.0,1.0,0.0,2.063884,0.388871,-1.041760,0.785728,-0.911583,-0.365276

In [56]:
from sklearn.model_selection import train_test_split

In [57]:
xtrain,xtest,ytrain,ytest=train_test_split(data,y,train_size=0.8)

In [58]:
print(xtrain.shape)
print(ytrain.shape)
print(xtest.shape)
print(ytest.shape)

(8000, 11)
(8000,)
(2000, 11)
(2000,)

In [59]:
from sklearn.linear_model import LogisticRegression
algo=LogisticRegression()

In [60]:
algo.fit(xtrain,ytrain)

LogisticRegression()

In [62]:
out=algo.predict(xtest)

In [67]:
from sklearn.metrics import accuracy_score, confusion_matrix

In [68]:
accuracy_score(ytest,out)

0.7915

In [69]:
confusion_matrix(ytest,out)

array([[1535,   56],
       [ 361,   48]], dtype=int64)

In [70]:
import joblib

In [73]:
joblib.dump(algo,r"C:\Users\dell\Desktop\rupesh\Data Science Courses\Ashish Pandey Classes\datasets\datasets\bank.pkl")

['C:\\Users\\dell\\Desktop\\rupesh\\Data Science Courses\\Ashish Pandey Classes\\datasets\\datasets\\bank.pkl']

In [74]:
joblib.dump(transform,r"C:\Users\dell\Desktop\rupesh\Data Science Courses\Ashish Pandey Classes\datasets\datasets\bank-pre.pkl")

['C:\\Users\\dell\\Desktop\\rupesh\\Data Science Courses\\Ashish Pandey Classes\\datasets\\datasets\\bank-pre.pkl']

In [75]:
model = joblib.load(r"C:\Users\dell\Desktop\rupesh\Data Science Courses\Ashish Pandey Classes\datasets\datasets\bank.pkl")
pre = joblib.load(r"C:\Users\dell\Desktop\rupesh\Data Science Courses\Ashish Pandey Classes\datasets\datasets\bank-pre.pkl")

In [80]:
data.head()

     0        1       2   3  4        5  6  7  8        9
0  600  Germany  Female  45  2  45895.0  2  1  0  45782.2

In [76]:
data = np.array([[600,"Germany","Female",45,2,45895.0,2,1,0,45782.2]])

In [77]:
data=pd.DataFrame(data)

In [78]:
data

     0        1       2   3  4        5  6  7  8        9
0  600  Germany  Female  45  2  45895.0  2  1  0  45782.2

In [79]:
data=pre.transform(data)

ValueError: Number of features of the input must be equal to or greater than that of the fitted transformer. Transformer n_features is 11 and input n_features is 10.

In [ ]:
model.predict(data)

In [ ]:
model.predict_proba(data)